//Задача 2. Дан одномерный массив целых чисел, проверить, упорядочен ли он по возрастанию.
//Решить с флажком F типа bool, начальное значение false, лучше циклом while.
//Цикл завершается, когда перебраны все элементы или найдено нарушение, то есть соседние элементы со знаком >= (тогда F = true и проверка прекращается).
//Если ни одно сравнение не нарушило знак «меньше», вывести сообщение, что массив упорядочен.
#include <iostream>
using namespace std;
int main()
{
    bool f=false;
    int m[10]={1,6,3,85,56,4,9,7,1,85},i=0,a,b;
    while ((!f) && (i<10-1))
    {
        a=m[i];
        b=m[i+1];
        if (a>=b) f=true;
        i+=1;
    }
    if (f) cout<<"posledovatelnost ne uporyadochena";
    else cout << "posledovatelnost uporyadochena";
    return 0;
}